"""
2. Програма отримує на вхід координати певної клітинки на шаховій дошці в шаховій нотації,
тобто, у вигляді e2, де спочатку записується номер стовпця (буква від a до h, зліва направо),
потім номер рядка (цифра від 1 до 8, знизу догори).
Виведіть на екран зображення шахової дошки, в якому вказаний колір клітинки: B (чорний колір) або W (білий колір).
Aвтор: Мотовилець Марія
"""
n = input("Введіть координати дошки (буква та число без пропуску): ")
col = int(n[1])-1
match n[0]:
    case 'a':
        row = 7
    case 'b':
        row = 6
    case 'c':
        row = 5
    case 'd':
        row = 4
    case 'e':
        row = 3
    case 'f':
        row = 2
    case 'g':
        row = 1
    case 'h':
        row = 0

board = [['.','.','.','.','.','.','.','.'],
         ['.','.','.','.','.','.','.','.'],
         ['.','.','.','.','.','.','.','.'],
         ['.','.','.','.','.','.','.','.'],
         ['.','.','.','.','.','.','.','.'],
         ['.','.','.','.','.','.','.','.'],
         ['.','.','.','.','.','.','.','.'],
         ['.','.','.','.','.','.','.','.']]

if (row + col)%2 != 0:
    board[row][col] = 'B'
else:
    board[row][col] = 'W'
for i in range (8):
    for j in range (8):
        print(board[i][j], end=' ')
    print()






